//%attributes = {"invisible":true,"preemptive":"indifferent","executedOnServer":false,"publishedSql":false,"shared":false,"publishedWsdl":false,"publishedSoap":false,"publishedWeb":false,"published4DMobile":{"scope":"none"}}
/*

#########  THIS METHOD IS A PULL OF CODE PORTION USE AS TEST OR CHECK

THIS METHOD IS NEVER CALLED, JUST AS SANDBOX CODE

*/

/* ⚠️

➗ ➖ ✖️ ➕ ©️ ™️ ®️ ♾️

⭕ ⁉️ ❓ ❗‼️

☑️ ✳️ 🚫 🆔 🆘 ✅ ❎ ✔️ ⛔ ♻️ 📎

*️⃣ #️⃣ 0️⃣ 1️⃣ 2️⃣ 3️⃣ 4️⃣ 5️⃣ 6️⃣ 7️⃣ 8️⃣ 9️⃣ 🔟

⬇️ ⬅️ ⬆️ ➡️ ↩️ 🔄 🔃 📶 ⏩ ⏏️ ⏺️ ▶️ 🔀 ⏯️ ⏸️ ⏮️ ⏭️ ⏫ ⏬ ⏹️ ⏪ ◀️ 🔂 🔁 🔼 🔽 ↕️↔️

🔆 🔅 👻 ⌛ ⏳ ⚓ 🚦 🚥

🤔 🤙 😎 🧐 🤓 ☺️ 😚 😗 😋 🤪 😛 😜 😝 🤗 🤔 🤭 🤫 😧 😰 😮 😕 😖 😞 😓 😨 😢 😱 😦 ☹️ 🙁 😟 🥺 😳 😲 😥

😌 🥴 🤧 🤤 😪 😷 🤕 🤒 🥵 🤨 😏 😒 🤥 😬 😐 🙄 😑 😊 😆 🤣 🙂 😉 🙃 😀 😁 🤠

🤘 🖕 🤞 🤚 ☝️ 👉 👈 👇 👆 ✋ 🖐️ 👌 🤜 🤛 👊 ✊ 👎 👍 🤙 🤟 ✌️

⏱️ 🕔 🕠 🕑 🕝 🕙 🕥 🕗 🕣 🕟 🕓 🕦 🕚 🕤 🕘 🕧 🕛 🕖 🕢 🕕 🕡 🕒 🕞 🕐 🕜

☁️⛅⛈️🌤️🌥️🌦️🌧️🌨️🌩️☀️

⚪ ⚫ 🔴 🔵

🖤 ❤️ 💜 💞 💨 💦 💫  🕳️ 🗯️💬 💭



Smiley

😀😁😂🤣😃😄😅😆😉😊😋😎😍😘😗😙😚🙂🤗🤩🤔🤨😐😑😶🙄
😏😣😥😮🤐😯😪😫😴😌😛😜😝🤤😒😓😔😕🙃🤑😲☹🙁😖😞😟
😤😢😭😦😧😨😩🤯😬😰😱😳🤪😵😡😠🤬😷🤒🤕🤢🤮🤧😇🤠🤥
🤫🤭🧐🤓😈👿🤡👹👺💀☠👻👽👾🤖💩😺😸😹😻😼😽🙀😿😾🙈🙉🙊


Personnages

👶👧🧒👦👩🧑👨👵🧓👴👲👳‍♀️👳‍♂️🧕👮‍♀️👮‍♂️👷‍♀️👷‍♂️💂‍♀️💂‍♂️🕵️‍♀️🕵️‍♂️👩‍⚕️👨‍⚕️👩‍🌾👨‍🌾
👩‍🍳👨‍🍳👩‍🎓👨‍🎓👩‍🎤👨‍🎤👩‍🏫👨‍🏫👩‍🏭👨‍🏭👩‍💻👨‍💻👩‍💼👨‍💼👩‍🔧👨‍🔧👩‍🔬👨‍🔬👩‍🎨👨‍🎨👩‍🚒👨‍🚒👩‍✈️👨‍✈️👩‍🚀👨‍🚀
👩‍⚖️👨‍⚖️👰🤵👸🤴🤶🎅🧙‍♀️🧙‍♂️🧝‍♀️🧝‍♂️🧛‍♀️🧛‍♂️🧟‍♀️🧟‍♂️🧞‍♀️🧞‍♂️🧜‍♀️🧜‍♂️🧚‍♀️🧚‍♂️👼🤰🤱🙇‍♀️
🙇‍♂️💁‍♀️💁‍♂️🙅‍♀️🙅‍♂️🙆‍♀️🙆‍♂️🙋‍♀️🙋‍♂️🤦‍♀️🤦‍♂️🤷‍♀️🤷‍♂️🙎‍♀️🙎‍♂️🙍‍♀️🙍‍♂️💇‍♀️💇‍♂️💆‍♀️💆‍♂️🧖‍♀️🧖‍♂️💅🤳💃
🕺👯‍♀️👯‍♂️🕴🚶‍♀️🚶‍♂️👫👭👬💑👩‍❤️‍👩👨‍❤️‍👨💏👩‍❤️‍💋‍👩👨‍❤️‍💋‍👨👪👨‍👩‍👧👨‍👩‍👧‍👦👨‍👩‍👦‍👦👨‍👩‍👧‍👧👩‍👩‍👦👩‍👩‍👧👩‍👩‍👧‍👦👩‍👩‍👦‍👦👩‍👩‍👧‍👧👨‍👨‍👦
👨‍👨‍👧👨‍👨‍👧‍👦👨‍👨‍👦‍👦👨‍👨‍👧‍👧👩‍👦👩‍👧👩‍👧‍👦👩‍👦‍👦👩‍👧‍👧👨‍👦👨‍👧👨‍👧‍👦👨‍👦‍👦👨‍👧‍👧🗣👤👥


Gestes et corps

🤳💪👈👉☝👆🖕👇✌🤞🖖🤘🤙🖐✋👌👍👎✊👊🤛🤜🤚👋🤟✍
👏👐🙌🤲🙏🤝💅👂👃👣👀👁👁️‍🗨️🧠👅👄


Sentiments, émotions

💋💘💝💖💗💓💞💕💌❣💔❤🧡💛💚💙💜🖤💟💤💢💣💥💦💨💫💬🗨🗯💭🕳


Vêtements et accessoires

👓🕶👔👕👖🧣🧤🧥🧦👗👘👙👚👛👜👝🛍🎒👞👟👠👡👢👑👒🎩🎓🧢⛑📿💄💍💎

Sport et activités

⚽️ 🏀 🏈 ⚾️ 🎾 🏐 🏉 🎱 🏓 🏸 🥅 🏒 🏑 🏏 ⛳️ 🏹 🎣 🥊 🥋 🎽 ⛸ 🥌 🛷 🎿 ⛷ 🏂
🏋️‍♀️ 🏋🏻‍♀️ 🏋🏼‍♀️ 🏋🏽‍♀️ 🏋🏾‍♀️ 🏋🏿‍♀️
🏋️‍♂️ 🏋🏻‍♂️ 🏋🏼‍♂️ 🏋🏽‍♂️ 🏋🏾‍♂️ 🏋🏿‍♂️
🤼‍♀️ 🤼‍♂️
🤸‍♀️ 🤸🏻‍♀️ 🤸🏼‍♀️ 🤸🏽‍♀️ 🤸🏾‍♀️ 🤸🏿‍♀️
🤸‍♂️ 🤸🏻‍♂️ 🤸🏼‍♂️ 🤸🏽‍♂️ 🤸🏾‍♂️ 🤸🏿‍♂️
⛹️‍♀️ ⛹🏻‍♀️ ⛹🏼‍♀️ ⛹🏽‍♀️ ⛹🏾‍♀️ ⛹🏿‍♀️
⛹️‍♂️ ⛹🏻‍♂️ ⛹🏼‍♂️ ⛹🏽‍♂️ ⛹🏾‍♂️ ⛹🏿‍♂️
🤺
🤾‍♀️ 🤾🏻‍♀️ 🤾🏼‍♀️ 🤾🏾‍♀️ 🤾🏾‍♀️ 🤾🏿‍♀️
🤾‍♂️ 🤾🏻‍♂️ 🤾🏼‍♂️ 🤾🏽‍♂️ 🤾🏾‍♂️ 🤾🏿‍♂️
🏌️‍♀️ 🏌🏻‍♀️ 🏌🏼‍♀️ 🏌🏽‍♀️ 🏌🏾‍♀️ 🏌🏿‍♀️
🏌️‍♂️ 🏌🏻‍♂️ 🏌🏼‍♂️ 🏌🏽‍♂️ 🏌🏾‍♂️ 🏌🏿‍♂️
🏇 🏇🏻 🏇🏼 🏇🏽 🏇🏾 🏇🏿
🧘‍♀️ 🧘🏻‍♀️ 🧘🏼‍♀️ 🧘🏽‍♀️ 🧘🏾‍♀️ 🧘🏿‍♀️
🧘‍♂️ 🧘🏻‍♂️ 🧘🏼‍♂️ 🧘🏽‍♂️ 🧘🏾‍♂️ 🧘🏿‍♂️
🏄‍♀️ 🏄🏻‍♀️ 🏄🏼‍♀️ 🏄🏽‍♀️ 🏄🏾‍♀️ 🏄🏿‍♀️
🏄‍♂️ 🏄🏻‍♂️ 🏄🏼‍♂️ 🏄🏽‍♂️ 🏄🏾‍♂️ 🏄🏿‍♂️
🏊‍♀️ 🏊🏻‍♀️ 🏊🏼‍♀️ 🏊🏽‍♀️ 🏊🏾‍♀️ 🏊🏿‍♀️
🏊‍♂️ 🏊🏻‍♂️ 🏊🏼‍♂️ 🏊🏽‍♂️ 🏊🏾‍♂️ 🏊🏿‍♂️
🤽‍♀️ 🤽🏻‍♀️ 🤽🏼‍♀️ 🤽🏽‍♀️ 🤽🏾‍♀️ 🤽🏿‍♀️
🤽‍♂️ 🤽🏻‍♂️ 🤽🏼‍♂️ 🤽🏽‍♂️ 🤽🏾‍♂️ 🤽🏿‍♂️
🚣‍♀️ 🚣🏻‍♀️ 🚣🏼‍♀️ 🚣🏽‍♀️ 🚣🏾‍♀️ 🚣🏿‍♀️
🚣‍♂️ 🚣🏻‍♂️ 🚣🏼‍♂️ 🚣🏽‍♂️ 🚣🏾‍♂️ 🚣🏿‍♂️
🧗‍♀️ 🧗🏻‍♀️ 🧗🏼‍♀️ 🧗🏽‍♀️ 🧗🏾‍♀️ 🧗🏿‍♀️
🧗‍♂️ 🧗🏻‍♂️ 🧗🏼‍♂️ 🧗🏽‍♂️ 🧗🏾‍♂️ 🧗🏿‍♂️
🚵‍♀️ 🚵🏻‍♀️ 🚵🏼‍♀️ 🚵🏽‍♀️ 🚵🏾‍♀️ 🚵🏿‍♀️
🚵‍♂️ 🚵🏻‍♂️ 🚵🏼‍♂️ 🚵🏽‍♂️ 🚵🏾‍♂️ 🚵🏿‍♂️
🚴‍♀️ 🚴🏻‍♀️ 🚴🏼‍♀️ 🚴🏽‍♀️ 🚴🏾‍♀️ 🚴🏿‍♀️
🚴‍♂️ 🚴🏻‍♂️ 🚴🏼‍♂️ 🚴🏽‍♂️ 🚴🏾‍♂️ 🚴🏿‍♂️
🏆 🥇 🥈 🥉 🏅 🎖 🏵 🎗 🎫 🎟 🎪 🤹‍♀️ 🤹🏻‍♀️ 🤹🏼‍♀️ 🤹🏽‍♀️ 🤹🏾‍♀️ 🤹🏿‍♀️ 🤹‍♂️ 🤹🏻‍♂️ 🤹🏼‍♂️ 🤹🏽‍♂️ 🤹🏾‍♂️ 🤹🏿‍♂️ 🎭 🎨 🎬 🎤 🎧 🎼 🎹 🥁 🎷 🎺 🎸 🎻 🎲 🎯 🎳 🎮 🎰

Animaux et plantes

🐶🐱🐭🐹🐰🦊🐻🐼🐨🐯🦁🐮🐷🐽🐸🐵🙈🙉🙊🐒🐔🐧🐦🐤🐣🐥🦆🦅🦉🦇🐺🐗🐴🦄🐝🐛🦋🐌🐚🐞🐜🦗🕷🕸🦂🐢🐍🦎🦖🦕🐙🦑🦐🦀🐡🐠🐟🐬
🐳🐋🦈🐊🐅🐆🦓🦍🐘🦏🐪🐫🦒🐃🐂🐄🐎🐖🐏🐑🐐🦌🐕🐩🐈🐓🦃🕊🐇🐁🐀🐿🦔🐾🐉🐲🌵🎄🌲🌳🌴🌱🌿☘️🍀🎍🎋🍃🍂🍁🍄🌾💐🌷🌹🥀🌺🌸🌼🌻


Nourriture et boissons

🍏🍎🍐🍊🍋🍌🍉🍇🍓🍈🍒🍑🍍🥥🥝🍅🍆🥑🥦🥒🌶🌽🥕🥔🍠🥐🍞🥖🥨🧀🥚🍳🥞🥓🥩🍗🍖🌭🍔🍟🍕🥪🥙🌮🌯🥗🥘🥫🍝🍜🍲🍛🍣🍱🥟🍤🍙🍚🍘🍥
🥠🍢🍡🍧🍨🍦🥧🍰🎂🍮🍭🍬🍫🍿🍩🍪🌰🥜🍯🥛🍼☕️🍵🥤🍶🍺🍻🥂🍷🥃🍸🍹🍾🥄🍴🍽🥣🥡🥢

Lieux et batiments

🌍🌎🌏🌐🗺🗾🏔⛰🌋🗻🏕🏖🏜🏝🏞🏟🏛🏗🏘🏚🏠🏡🏢🏣🏤🏥🏦🏨🏩🏪🏫🏬🏭🏯🏰💒🗼🗽⛪🕌🕍⛩🕋⛲⛺🌁🌃🏙🌄🌅🌆🌇🌉♨🌌🎠🎡🎢💈🎪


Transport

🚂🚃🚄🚅🚆🚇🚈🚉🚊🚝🚞🚋🚌🚍🚎🚐🚑🚒🚓🚔🚕🚖🚗🚘🚙🚚🚛🚜🚲🛴🛹🛵🚏🛣🛤🛢⛽🚨🚥🚦🛑🚧⚓⛵🛶🚤🛳⛴🛥🚢✈🛩
🛫🛬💺🚁🚟🚠🚡🛰🚀🛸

Ciel et météo

🌑🌒🌓🌔🌕🌖🌗🌘🌙🌚🌛🌜🌡☀🌝🌞⭐🌟🌠☁⛅⛈🌤🌥🌦🌧🌨🌩🌪🌫🌬🌀🌈🌂☂☔⛱⚡❄☃⛄☄🔥💧🌊


Travail et informatique

⌚️📱📲💻⌨️🖥🖨🖱🖲🕹🗜💽💾💿📀📼📷📸📹🎥📽🎞📞☎️📟📠📺📻🎙🎚🎛⏱⏲⏰🕰⌛️⏳📡🔋🔌💡🔦🕯🗑🛢💸💵💴💶💷💰💳💎⚖️
🔧🔨⚒🛠⛏🔩⚙️⛓🔫💣🔪🗡⚔️🛡🚬⚰️⚱️🏺🔮📿💈⚗️🔭🔬🕳💊💉🌡🚽🚰🚿🛁🛀🛀🏻🛀🏼🛀🏽🛀🏾🛀🏿🛎🔑🗝🚪🛋🛏🛌🖼🛍🛒🎁🎈🎏🎀🎊🎉🎎🏮🎐
✉️📩📨📧💌📥📤📦🏷📪📫📬📭📮📯📜📃📄📑📊📈📉🗒🗓📆📅📇🗃🗳🗄📋📁📂🗂🗞📰📓📔📒📕📗📘📙📚📖🔖🔗📎🖇📐📏📌📍✂️
🖊🖋✒️🖌🖍📝✏️🔍🔎🔏🔐🔒🔓


Symboles

☮ ✝️ ☪️ 🕉 ☸️ ✡️ 🔯 🕎 ☯️ ☦️ 🛐 ⛎ ♈ ♉ ♊️ ♋️ ♌️ ♍️ ♎ ♏ ♐ ♑️ ♒️ ♓️ 🆔 ⚛️
🉑 ☢️ ☣ 📴 📳 🈶 🈚 ️🈸 🈺 🈷️ ✴️ 🆚 💮
🉐 ㊙️ ㊗️ 🈴 🈵 🈹 🈲 🅰️ 🅱️ 🆎 🆑 🅾️ 🆘
❌⭕️🛑⛔️📛🚫💯💢♨️🚷🚯🚳🚱🔞📵🚭❗️❕❓❔‼️⁉️ 💯
🔅🔆〽️⚠️🚸🔱⚜️🔰♻️✅🈯️💹❇️✳️❎
🌐💠Ⓜ️🌀💤🏧🚾♿️🅿️🈳🈂️🛂🛃🛄🛅🚹🚺🚼
🚻🚮🎦📶🈁🔣ℹ️🔤🔡🔠🆖🆗🆙🆒🆕🆓
0️⃣1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣8️⃣9️⃣🔟🔢#️⃣*️⃣⏏️▶️⏸⏯⏹⏺⏭⏮⏩⏪⏫⏬◀️🔼🔽➡️⬅️⬆️⬇️↗️↘️↙️↖️↕️↔️↪️↩️⤴️⤵️🔀🔁🔂🔄🔃
🎵🎶➕➖➗✖️💲💱™️©️®️〰️➰➿🔚🔙🔛🔝🔜✔️
☑️🔘⚪️⚫️🔴🔵🔺🔻🔸🔹🔶🔷🔳🔲▪️▫️◾️◽️◼️◻️⬛️⬜️🔈🔇🔉🔊🔔🔕📣📢👁‍🗨💬💭🗯♠️♣️♥️♦️🃏🎴🀄️
🕐🕑🕒🕓🕔🕕🕖🕗🕘🕙🕚🕛🕜🕝🕞🕟🕠🕡🕢🕣🕤🕥🕦🕧


Drapeaux

🏳️ 🏴 🏁 🚩 🏳️‍🌈 🇦🇫 🇦🇽 🇦🇱 🇩🇿 🇦🇸 🇦🇩 🇦🇴 🇦🇮 🇦🇶 🇦🇬 🇦🇷 🇦🇲 🇦🇼 🇦🇺 🇦🇹 🇦🇿 🇧🇸 🇧🇭 🇧🇩 🇧🇧 🇧🇾 🇧🇪 🇧🇿 🇧🇯 🇧🇲 🇧🇹 🇧🇴 🇧🇦 🇧🇼 🇧🇷 🇮🇴
🇻🇬 🇧🇳 🇧🇬 🇧🇫 🇧🇮 🇰🇭 🇨🇲 🇨🇦 🇮🇨 🇨🇻 🇧🇶 🇰🇾 🇨🇫 🇹🇩 🇨🇱 🇨🇳 🇨🇽 🇨🇨 🇨🇴 🇰🇲 🇨🇬 🇨🇩 🇨🇰 🇨🇷 🇨🇮 🇭🇷 🇨🇺 🇨🇼 🇨🇾 🇨🇿 🇩🇰 🇩🇯 🇩🇲 🇩🇴 🇪🇨 🇪🇬
🇸🇻 🇬🇶 🇪🇷 🇪🇪 🇪🇹 🇪🇺 🇫🇰 🇫🇴 🇫🇯 🇫🇮 🇫🇷 🇬🇫 🇵🇫 🇹🇫 🇬🇦 🇬🇲 🇬🇪 🇩🇪 🇬🇭 🇬🇮 🇬🇷 🇬🇱 🇬🇩 🇬🇵 🇬🇺 🇬🇹 🇬🇬 🇬🇳 🇬🇼 🇬🇾 🇭🇹 🇭🇳 🇭🇰 🇭🇺 🇮🇸 🇮🇳
🇮🇩 🇮🇷 🇮🇶 🇮🇪 🇮🇲 🇮🇱 🇮🇹 🇯🇲 🇯🇵 🎌 🇯🇪 🇯🇴 🇰🇿 🇰🇪 🇰🇮 🇽🇰 🇰🇼 🇰🇬 🇱🇦 🇱🇻 🇱🇧 🇱🇸 🇱🇷 🇱🇾 🇱🇮 🇱🇹 🇱🇺 🇲🇴 🇲🇰 🇲🇬 🇲🇼 🇲🇾 🇲🇻 🇲🇱 🇲🇹 🇲🇭
🇲🇶 🇲🇷 🇲🇺 🇾🇹 🇲🇽 🇫🇲 🇲🇩 🇲🇨 🇲🇳 🇲🇪 🇲🇸 🇲🇦 🇲🇿 🇲🇲 🇳🇦 🇳🇷 🇳🇵 🇳🇱 🇳🇨 🇳🇿 🇳🇮 🇳🇪 🇳🇬 🇳🇺 🇳🇫 🇰🇵 🇲🇵 🇳🇴 🇴🇲 🇵🇰 🇵🇼 🇵🇸 🇵🇦 🇵🇬 🇵🇾 🇵🇪
🇵🇭 🇵🇳 🇵🇱 🇵🇹 🇵🇷 🇶🇦 🇷🇪 🇷🇴 🇷🇺 🇷🇼 🇼🇸 🇸🇲 🇸🇦 🇸🇳 🇷🇸 🇸🇨 🇸🇱 🇸🇬 🇸🇽 🇸🇰 🇸🇮 🇬🇸 🇸🇧 🇸🇴 🇿🇦 🇰🇷 🇸🇸 🇪🇸 🇱🇰 🇧🇱 🇸🇭 🇰🇳 🇱🇨 🇵🇲 🇻🇨 🇸🇩
🇸🇷 🇸🇿 🇸🇪 🇨🇭 🇸🇾 🇹🇼 🇹🇯 🇹🇿 🇹🇭 🇹🇱 🇹🇬 🇹🇰 🇹🇴 🇹🇹 🇹🇳 🇹🇷 🇹🇲 🇹🇨 🇹🇻 🇻🇮 🇺🇬 🇺🇦 🇦🇪 🇬🇧 🏴󠁧󠁢󠁥󠁮󠁧󠁿 🏴󠁧󠁢󠁳󠁣󠁴󠁿 🏴󠁧󠁢󠁷󠁬󠁳󠁿 🇺🇸 🇺🇾 🇺🇿 🇻🇺 🇻🇦 🇻🇪 🇻🇳 🇼🇫 🇪🇭
🇾🇪 🇿🇲 🇿🇼





https://blog.4d.com/4d-write-pro-documents-and-pictures/
https://blog.4d.com/4d-write-pro-more-simple-more-powerful/
https://blog.4d.com/4d-write-pro-a-new-way-to-set-tabs/
https://blog.4d.com/4d-write-pro-now-supports-picture-expressions/
https://blog.4d.com/4d-write-pro-pagination-printing/
https://blog.4d.com/4d-write-pro-supports-tables/
https://blog.4d.com/4d-write-pro-document-creation-by-programming/
https://blog.4d.com/insert-pictures-4d-write-pro/cgm
https://blog.4d.com/headers-and-footers-in-4d-write-pro/
https://blog.4d.com/programmatically-manage-headers-and-footers-in-4d-write-pro/
https://blog.4d.com/manage-sections-with-code-in-a-4d-write-pro-document/
https://blog.4d.com/table-pagination-in-4d-write-pro/qsd

https://blog.4d.com/a-new-feature-in-4d-write-pro-bookmarks/
https://blog.4d.com/better-documents-with-two-new-attributes/
https://blog.4d.com/page-layout-in-4d-write-pro/
https://blog.4d.com/create-multi-column-documents-in-4d-write-pro/
https://blog.4d.com/four-different-ways-to-use-objects-with-4d-write-pro/
https://blog.4d.com/programmatically-access-elements-in-4d-write-pro/

⚠️

*Resolving Naming Conflicts *
Be sure to use unique names for the different elements in your database. If a particular object has the same name as another object of a different type (for example, if a field is named Person and a variable is also named Person), 4D uses a priority system.
4D identifies names used in procedures in the following order:
1. Fields
2. Commands
3. Methods
4. Plug-in routines
5. Predefined constants
6. Variables.
For example, 4D has a built-in command called Date. If you named a method Date, 4D would recognize it as the built-in Date command, and not as your method. This would prevent you from calling your method. If, however, you named a field “Date”, 4D would try to use your field instead of the Date command.


⚠️


Analyse des dépendances
Pour trouver les méthodes projet dépendantes, 4D analyse le code de la méthode et détecte :
les appels directs dans le code,
les noms de méthodes passés en paramètres à une des commandes suivantes :
Creer fenetre (paramètre caseFermeture)
APPELER SUR ERREUR
APPELER SUR EVENEMENT
Nouveau process
EXECUTER SUR CLIENT
FIXER METHODE LIGNE MENU
EXECUTER METHODE
Le nom passé en paramètre doit être une constante littérale de type texte correspondant à un nom de méthode exécutable valide.
Pour trouver un formulaire dépendant dans du code, 4D détectera un nom de formulaire passé en paramètre à une des commandes suivantes :
Imprimer ligne
DIALOGUE
FORM FIXER SORTIE
FORM FIXER ENTREE
PARAMETRES IMPRESSION
FORM LIRE PROPRIETES
Creer fenetre formulaire



//$equal:=New collection($t1).equal(New collection($t2);ck diacritical)
*/

//While ($oFile.exists=False)
//DELAY PROCESS(Current process; 1)
//End while 

//#DECLARE($name; $ownerLB : Text; $editorPageNo : Integer; $cboxes : Variant; $loadMethod; $saveMethod; $newMethod : Text; $subFormController : Object; $colOwnedLBs; $colDateWidgets : Collection; $panelConfig : Object)
// #DECLARE($name : Text; $ownerLB : Text; $editorPageNo : Integer; $cboxes : Variant; $loadMethod : Text; $saveMethod : Text; $newMethod : Text; $subFormController : Object; $colOwnedLBs : Collection; $colDateWidgets : Collection; $panelConfig : Object)


//$compilePath_s:=File(f"/PACKAGE/project/sources/forms/"+"_DataExplorer/form.4DForm")
//$txt:=Document to text($compilePath_s.platformPath)
//$txt:=JSON Stringify($txt)

//$x:=4D:C1709

// --------------------------------

/*
// https://discuss.4d.com/t/calling-a-class-function-from-a-menu/14985/7
$o:=New object("a";"This";"b";"Works!";"edit";Formula(This.a+" "+This.b))

$menu:=Create menu
APPEND MENU ITEM($menu;"Edit")
SET MENU ITEM PARAMETER($menu;-1;"workorder_edit")

$menu_choice:=Dynamic pop up menu($menu)
RELEASE MENU($menu)

$temp_c:=Split string($menu_choice;"_")

Case of
: ($temp_c.length=0)
: ($temp_c[0]="workorder")
$name:=$o[$temp_c[1]]()
ALERT($name)
//  and so on ...

End case
*/

// --------------------------------

//$o:=New object
//$o.f:=Formula(ALERT($1+" "+This["foo"]))
//$o["f"].call(New object("foo";"bar");"message")

// --------------------------------



//If ($o[$keytofind]#Null)
//$result:=$o[$keytofind]
//End if

// --------------------------------

//C_OBJECT($ds)

//$ds:=New object("location";New object;"people";New object)
//$people:=$ds.people

//$people["peter"]:=New object("name";"peter";"location";"France")
//$people["paul"]:=New object("name";"paul";"location";"US")
//$people["beth"]:=New object("name";"beth";"location";"Spain")
//$people["mary"]:=New object("name";"mary";"location";"US")

//$location:=$ds.location

//For each ($name;$people)
//If ($location[$people[$name].location]=Null)
//$location[$people[$name].location]:=New collection
//End if
//$location[$people[$name].location].push($people[$name])
//End for each

//  //I want to know who is located in the US

//$peopleLocatedInTheUS:=$location["US"]

// -------------------------------------------

//$from_t:="FR"
//$to_t:="EN"
//$text:=Get text from pasteboard
//METHOD SET CODE("__aaa__temp";$text;*)
//METHOD GET CODE("__aaa__temp";$text;Code with tokens;*)
//METHOD SET CODE("__aaa__temp";"";*)

//C_COLLECTION($controlFlow_c)
//$controlFlow_c:=MM_controlFlows
//For each ($controlFlow_o;$controlFlow_c)
//$chercher_t:=$controlFlow_o[$from_t]
//$remplacer_t:=$controlFlow_o[$to_t]
//$text:=Replace string($text;$chercher_t;$remplacer_t;*)
//End for each

//SET TEXT TO PASTEBOARD($text)

//$path:=Folder(Folder(fk database folder;*).platformPath;fk platform path;*)
//$file_path:=$path.platformPath+"frankie.png"
//$file_path:=Replace string($file_path;Folder separator;"/")
//$file_path:="Path:"+$file_path
// I get : "Path:oleeku/Users/oleeku/Desktop/menuPic/frankie.png"
// This do not work

